src/Documents/уатКорректировкаДолга/уатКорректировкаДолга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатКорректировкаДолга</name>
  <registerRecords>AccumulationRegister.уатВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.уатПлатежныйКалендарь</registerRecords>
  <registerRecords>AccumulationRegister.уатРасходы</registerRecords>
  <registerRecords>AccumulationRegister.уатДоходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Контрагент, долг которому мы корректируем</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <comment>Статья доходов по начислению задолженности</comment>
    <type>
      <types>CatalogRef.уатСтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <comment>Статья расходов по начислению задолженности</comment>
    <type>
      <types>CatalogRef.уатСтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПриход</name>
    <comment>Сумма увеличения долга контрагента</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасход</name>
    <comment>Сумма уменьшения долга контрагента</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мультивалютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <comment>Договора и сделки по которым выполняется взаимозачет</comment>
    <attributes>
      <name>Договор</name>
      <comment>Договор взаиморасчетов контрагента</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <comment>Сделка, по которой дебитор должен нам</comment>
      <type>
        <types>DocumentRef.уатРеализацияУслуг</types>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
        <types>DocumentRef.уатСчетНаОплатуПокупателю</types>
        <types>DocumentRef.уатСчетНаОплатуПоставщика</types>
        <types>DocumentRef.уатПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <comment>Курс валюты договора</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <comment>Кратность валюты договора</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УвеличениеДолга</name>
      <comment>Сумма, на которую надо увеличить долг контрагента</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УменьшениеДолга</name>
      <comment>Сумма, на которую надо уменьшить долг контрагента</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаТС</name>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВедениеВзаиморасчетовПоДоговорам/ВедениеВзаиморасчетовПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВедениеВзаиморасчетовПоДоговорам</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоДоговоруВЦелом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСчетам</name>
    <comment>По счетам</comment>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНаТС</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>СПоставщиком</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентомНаЗакупку</name>
    <comment>Используется для обмена с типовыми конфигурациями</comment>
  </enumValues>
  <enumValues>
    <name>СКомиссионеромНаЗакупку</name>
    <comment>Используется для обмена с типовыми конфигурациями</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/уатКорректировкаДолга/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	уатПроведение_проф.ПолучитьСтарыеЗаказыПередЗаписью(ЭтотОбъект);
	
	РасчитатьСуммуДокумента();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	уатОбщегоНазначенияСервер.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.уатКорректировкаДолга.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	уатПроведение_проф.ОтразитьВзаиморасчетыСКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение.ОтразитьДоходы(ДополнительныеСвойства, Движения, Отказ);
	уатПроведение.ОтразитьРасходы(ДополнительныеСвойства, Движения, Отказ);
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьПлатежныйКалендарь") Тогда
		уатПроведение_проф.ОтразитьПлатежныйКалендарь(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
		
	// Запись наборов записей.
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	уатПроведение_проф.ОбновитьТекущееСостояниеОплатыЗаказов(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.уатКорректировкаДолга.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	уатПроведение.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	уатПроведение.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	уатПроведение.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	уатПроведение_проф.ОбновитьТекущееСостояниеОплатыЗаказов(ЭтотОбъект);
	
	// Контроль
	Документы.уатКорректировкаДолга.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Заголовок = уатОбщегоНазначенияТиповые.уатПредставлениеДокументаПриПроведении(ЭтотОбъект);
	
	Если Мультивалютный Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВалютаДокумента"));
	КонецЕсли;
	
	флЕстьДоходы = Ложь;
	флЕстьРасходы = Ложь;
	Для Каждого ТекСтрока Из Состав Цикл
		ТекВидДоговора = ТекСтрока.Договор.ВидДоговора;
		ТекВедениеВзаиморасчетов = ТекСтрока.Договор.ВедениеВзаиморасчетов;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Сделка)
			И (ТекВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным
			ИЛИ ТекВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
			ИЛИ ТекВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказамНаТС) Тогда
			СтрокаСообщения = "В строке " + ТекСтрока.НомерСтроки + " табличной части ""Состав"" не указано значение сделки!";
			уатОбщегоНазначенияТиповые.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрока.Сделка) И НЕ ЗначениеЗаполнено(ТекСтрока.ЗаказНаТС)
			И (ТекВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам
			ИЛИ ТекВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоНакладным) Тогда
			мсвЗаказы = Документы.уатКорректировкаДолга.ЗаказыПоСделке(ТекСтрока.Сделка);
			Если мсвЗаказы.Количество() > 1 Тогда
				СтрокаСообщения = "В строке " + ТекСтрока.НомерСтроки + " табличной части ""Состав"" не указан Заказ!";
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);	
			КонецЕсли;
		КонецЕсли;
			
		Если ТекСтрока.УвеличениеДолга > ТекСтрока.УменьшениеДолга Тогда // УвеличениеДолга
			Если ТекВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
				флЕстьРасходы = Истина;
			Иначе
				флЕстьДоходы = Истина;
			КонецЕсли;
		ИначеЕсли ТекСтрока.УвеличениеДолга < ТекСтрока.УменьшениеДолга Тогда // УменьшениеДолга
			Если ТекВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
				флЕстьДоходы = Истина;
			Иначе
				флЕстьРасходы = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если флЕстьДоходы Тогда
		ПроверяемыеРеквизиты.Добавить("СтатьяДоходов");
	КонецЕсли;
	Если флЕстьРасходы Тогда
		ПроверяемыеРеквизиты.Добавить("СтатьяРасходов");
	КонецЕсли;
	
	уатОбщегоНазначения.ПроверкаЗаполненияПодразделения(Организация, Подразделение, Отказ, Заголовок);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура РасчитатьСуммуДокумента()
	СуммаПриход = 0;
	СуммаРасход = 0;
	Для Каждого ТекСтрока Из Состав Цикл
		Если Мультивалютный Тогда
			ТекСуммаПриход = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.УвеличениеДолга,
				ТекСтрока.Валюта,    ВалютаДокумента,
				ТекСтрока.Курс,      Курс,
				ТекСтрока.Кратность, Кратность);
			ТекСуммаРасход = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.УменьшениеДолга,
				ТекСтрока.Валюта,    ВалютаДокумента,
				ТекСтрока.Курс,      Курс,
				ТекСтрока.Кратность, Кратность);
		Иначе
			ТекСуммаПриход = ТекСтрока.УвеличениеДолга;
			ТекСуммаРасход = ТекСтрока.УменьшениеДолга;
		КонецЕсли;
		
		СуммаПриход = СуммаПриход + ТекСуммаПриход;
		СуммаРасход = СуммаРасход + ТекСуммаРасход;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#КонецЕсли
